read_verilog ../ITC99-RTL-Verilog/b21.v
hierarchy -check -top b21
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b21.v
