read_verilog ../ITC99-RTL-Verilog/b11.v
hierarchy -check -top b11
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b11.v
