read_verilog ../ITC99-RTL-Verilog/b12.v
hierarchy -check -top b12
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b12.v
