read_verilog ../MasterRTL/Benchmarks/ISCAS89/s38584.v
hierarchy -check -top s38584
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/s38584.v
