read_verilog ../ITC99-RTL-Verilog/b17.v
hierarchy -check -top b17
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b17.v
