read_verilog ../ITC99-RTL-Verilog/b19.v
hierarchy -check -top b19
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b19.v
