read_verilog ../ITC99-RTL-Verilog/b10.v
hierarchy -check -top b10
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b10.v
