read_verilog ../ITC99-RTL-Verilog/b20.v
hierarchy -check -top b20
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b20.v
