read_verilog ../ITC99-RTL-Verilog/b16.v
hierarchy -check -top b16
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b16.v
