read_verilog ../ITC99-RTL-Verilog/b13.v
hierarchy -check -top b13
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b13.v
