read_verilog ../ITC99-RTL-Verilog/b18.v
hierarchy -check -top b18
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b18.v
