read_verilog ../ITC99-RTL-Verilog/b22.v
hierarchy -check -top b22
proc; flatten; opt; fsm; opt; memory; opt;
techmap; opt;
write_verilog ../test/verilog/b22.v
